app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "hours_left", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ben"], ["hours_left", 152.0], ["created_at", "2016-03-11 21:10:04.061961"], ["updated_at", "2016-03-11 21:10:04.061961"]]

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "hours_left" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["hours_left", 152.0], ["updated_at", "2016-03-12 01:24:05.714183"], ["id", 2]]

  def destroy
    TimeOffInstance.all.map { |e|
      if e.employee_id == @employee.id
        e.destroy
---
SELECT "time_off_instances".* FROM "time_off_instances"
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
DELETE FROM "time_off_instances" WHERE "time_off_instances"."id" = ?  [["id", 22]]