app/controllers/time_off_instances_controller.rb

SELECT "time_off_instances".* FROM "time_off_instances"
---
  def index
    @time_off_instances = TimeOffInstance.all

SELECT "employees".* FROM "employees"
---
  def new
    @time_off_instance = TimeOffInstance.new
    @employees = Employee.all

SELECT "employees".* FROM "employees"
---
  def edit
    @employees = Employee.all

INSERT INTO "time_off_instances" ("employee_id", "hours_used", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_id", 2], ["hours_used", 4.0], ["reason", "had to go to the doctors"], ["created_at", "2016-03-12 07:26:26.727886"], ["updated_at", "2016-03-12 07:26:26.727886"]]
---
  def create
    @time_off_instance = TimeOffInstance.new(time_off_instance_params)
    #@time_off_instance.employee.hours_left -= @time_off_instance.hours_used
    respond_to do |format|
      if @time_off_instance.save

UPDATE "time_off_instances" SET "hours_used" = ?, "updated_at" = ? WHERE "time_off_instances"."id" = ?  [["hours_used", 4.0], ["updated_at", "2016-03-12 07:47:37.778349"], ["id", 23]]
---
  def update
    respond_to do |format|
      self.unuse_pto_hours
      if @time_off_instance.update(time_off_instance_params)

DELETE FROM "time_off_instances" WHERE "time_off_instances"."id" = ?  [["id", 1]]
---
  def destroy
    self.unuse_pto_hours
    @time_off_instance.destroy

SELECT  "time_off_instances".* FROM "time_off_instances" WHERE "time_off_instances"."id" = ? LIMIT 1  [["id", 23]]
---
    def set_time_off_instance
      @time_off_instance = TimeOffInstance.find(params[:id])